app/controllers/messages_controller.rb

    def create
      @current_user = current_user
      @message = @current_user.messages.create(content: msg_params[:content], room_id: params[:room_id])
---
INSERT INTO "messages" ("user_id", "room_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 1], ["room_id", 2], ["content", "helllo"], ["created_at", "2023-12-05 07:57:00.972353"], ["updated_at", "2023-12-05 07:57:00.972353"]]