app/controllers/rooms_controller.rb

    def create
      @room = Room.create(name: params["room"]["name"])
---
INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "roommate"], ["is_private", 0], ["created_at", "2023-12-05 03:28:24.664870"], ["updated_at", "2023-12-05 03:28:24.664870"]]

  def show
    @current_user = current_user
    @single_room = Room.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]