app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "private_1_2"], ["is_private", 1], ["created_at", "2023-12-05 10:45:40.023257"], ["updated_at", "2023-12-05 10:45:40.023257"]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."name" = ? ORDER BY "rooms"."id" ASC LIMIT ?  [["name", "private_1_2"], ["LIMIT", 1]]
---
    def show
      @user = User.find(params[:id])
      @current_user = current_user
      @rooms = Room.public_rooms
      @users = User.all_except(@current_user)
      @room = Room.new
      @message = Message.new
      @room_name = get_name(@user, @current_user)
      @single_room = Room.where(name: @room_name).first || Room.create_private_room([@user, @current_user], @room_name)