app/models/room.rb

INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "private_1_2"], ["is_private", 1], ["created_at", "2023-12-05 10:45:40.023257"], ["updated_at", "2023-12-05 10:45:40.023257"]]
INSERT INTO "participants" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["user_id", 2], ["room_id", 4], ["created_at", "2023-12-05 10:45:40.050154"], ["updated_at", "2023-12-05 10:45:40.050154"]]
---
    def self.create_private_room(users, room_name)
        single_room = Room.create(name: room_name, is_private: true)
        users.each do |user|
            Participant.create(user_id: user.id, room_id: single_room.id )